app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "rei book"], ["body", "rei book comment"], ["user_id", 1], ["created_at", "2021-07-27 01:16:53.777138"], ["updated_at", "2021-07-27 01:16:53.777138"]]

  def ensure_correct_user
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]