app/controllers/book_comments_controller.rb

    def create
        book = Book.find(params[:book_id])
        comment = BookComment.new(book_comment_params)
        comment.user_id = current_user.id
        comment.book_id = book.id
        comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "good"], ["user_id", 1], ["book_id", 3], ["created_at", "2021-07-27 11:23:21.240088"], ["updated_at", "2021-07-27 11:23:21.240088"]]